FROM python:3.11.9-slim

# -------------------------------
# Установка системных зависимостей
# -------------------------------
RUN apt-get update && apt-get install -y \
    build-essential \
    libpq-dev \
    curl \
    && rm -rf /var/lib/apt/lists/*

# -------------------------------
# Рабочая директория
# -------------------------------
WORKDIR /app

# -------------------------------
# Установка зависимостей
# -------------------------------
COPY requirements.txt .
RUN pip install --upgrade pip
RUN pip install -r requirements.txt

# -------------------------------
# Копирование проекта
# -------------------------------
COPY . .

# -------------------------------
# Переменные окружения
# -------------------------------
ENV PYTHONDONTWRITEBYTECODE 1
ENV PYTHONUNBUFFERED 1

# -------------------------------
# Порт приложения
# -------------------------------
EXPOSE 8000

# -------------------------------
# Команда запуска
# -------------------------------
# Для локальной разработки (с автообновлением при изменениях кода)
# Используй эту команду, если запускаешь контейнер на локальной машине
# CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]

# Для продакшена с Gunicorn
# Рекомендуется 2-4 воркера на 1 CPU, указываем bind на 0.0.0.0
CMD ["gunicorn", "core.wsgi:application", "--bind", "0.0.0.0:8000", "--workers", "4", "--log-level", "info", "--access-logfile", "-", "--error-logfile", "-"]
